---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteCircularLinks
source: html/4f2759a3-a08a-1e9a-7aff-51e6ff412262.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteCircularLinks Property

The pasted selection includes a linked instance of this file '[Name]'. A file cannot link itself, so the link was not pasted.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteCircularLinks { get; }
```